
const PROPERTIES = [
  {
    group_name: "時間関係",
    items: ["起源"]
  },
  {
    group_name: "因果関係",
    items: ["原因", "背景", "影響", "作用", "対策", "その他"]
  },
  {
    group_name: "論理関係",
    items: ["原理"]
  },
  {
    group_name: "階層関係",
    items: ["クラス", "インスタンス"]
  },
  {
    group_name: "全体部分関係",
    items: ["構成要素", "構造", "特徴"]
  },
  {
    group_name: "比較関係",
    items: ["類似概念", "対比概念"]
  }
];

const QTYPES = [
  {
    group_name: "事柄",
    items: ["事柄", "現象", "事件", "事故", "行事"]
  },
  {
    group_name: "時",
    items: ["時", "年代", "期間", "季節"]
  },
  {
    group_name: "人間性",
    items: ["肉体", "生理", "病気", "人物", "能力", "感情"]
  },
  {
    group_name: "自然",
    items: ["自然", "天文", "天候", "地域", "生物", "物質"]
  },
  {
    group_name: "社会活動",
    items: ["社会活動", "命", "人間関係", "社会階層", "組織", "産業", "職業", "生活", "娯楽", "行動"]
  },
  {
    group_name: "人造物・技術",
    items: ["人造物", "宗教", "学問", "制度", "文明・文化"]
  },
];

const QtypePropertyRelation: Record<string, string[]> = {
  "事柄": ["起源", "原因", "背景", "原理", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "現象": ["原因", "背景", "原理", "構成要素", "クラス", "インスタンス", "影響", "対策"],
  "事件": ["原因", "背景", "構成要素", "クラス", "インスタンス", "影響", "対策"],
  "事故": ["原因", "背景", "構成要素", "クラス", "インスタンス", "影響", "対策"],

  "行事": ["起源", "背景", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "時": ["起源", "背景", "クラス", "インスタンス", "特徴", "影響"],
  "年代": ["起源", "背景", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "期間": ["起源", "背景", "クラス", "インスタンス", "特徴", "影響"],
  "季節": ["起源", "構成要素", "クラス", "インスタンス", "特徴", "影響"],

  "肉体": ["構成要素", "構造", "クラス", "インスタンス", "影響"],
  "生理": ["原因", "原理", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "病気": ["原因", "原理", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "人物": ["経歴", "特徴", "影響"],
  "能力": ["起源", "原理", "構成要素", "クラス", "インスタンス", "影響"],
  "感情": ["原因", "クラス", "インスタンス", "影響"],

  "自然": ["起源", "原因", "背景", "原理", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "天文": ["起源", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響"],
  "天候": ["原理", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "地域": ["背景", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "生物": ["起源", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "物質": ["起源", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響"],

  "社会活動": ["起源", "原因", "背景", "原理", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響"],
  "命": ["起源", "背景", "クラス", "インスタンス"],
  "人間関係": ["起源", "背景", "クラス", "インスタンス", "特徴", "影響"],
  "社会階層": ["原因", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響"],
  "組織": ["起源", "背景", "構成要素", "クラス", "インスタンス", "特徴", "影響"],

  "産業": ["起源", "背景", "クラス", "インスタンス", "特徴", "影響"],
  "職業": ["起源", "背景", "クラス", "インスタンス", "特徴", "影響"],
  "生活": ["起源", "原理", "クラス", "インスタンス", "影響"],
  "娯楽": ["起源", "原理", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "行動": ["背景", "原理", "クラス", "インスタンス", "特徴", "影響"],

  "人造物": ["起源", "背景", "原理", "構成要素", "構造", "クラス", "インスタンス", "特徴", "影響"],
  "宗教": ["起源", "背景", "原理", "構成要素", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "学問": ["起源", "背景", "原理", "構成要素", "クラス", "インスタンス", "特徴", "影響", "対策"],
  "制度": ["起源", "背景", "原理", "構成要素", "クラス", "インスタンス", "特徴", "影響"],
  "文明・文化": ["起源", "構成要素", "クラス", "インスタンス", "背景", "特徴", "影響"],
};

export function getPropertiesByQtype(qtype: string | null) {
  if (!qtype) return PROPERTIES;

  const acceptable = QtypePropertyRelation[qtype];
  const properties = PROPERTIES.map(group => {
    return {
      group_name: group.group_name,
      items: group.items.filter(item => acceptable.includes(item))
    };
  });
  return properties;
}

export function getQtypes() {
  return QTYPES;
}
